[
    "Understanding the Time to First Response In GitHub Pull Requests",
    "Dealing with Popularity Bias in Recommender Systems for Third-party Libraries: How far Are We?",
    "Smart Contract Upgradeability on the Ethereum Blockchain Platform: An Exploratory Study",
    "An Exploratory Study of Ad Hoc Parsers in Python",
    "Improving Agile Planning for Reliable Software Delivery",
    "AutoML from Software Engineering Perspective: Landscapes and Challenges",
    "Characterizing and Understanding Software Security Vulnerabilities in Machine Learning Libraries",
    "DeepScenario: An Open Driving Scenario Dataset for Autonomous Driving System Testing",
    "PTMTorrent: A Dataset for Mining Open-source Pre-trained Model Packages",
    "Evaluating Software Documentation Quality",
    "NICHE: A Curated Dataset of Engineered Machine Learning Projects in Python",
    "PICASO: Enhancing API Recommendations with Relevant Stack Overflow Posts",
    "What Do Users Ask in Open-Source AI Repositories? An Empirical Study of GitHub Issues",
    "Enabling Analysis and Reasoning on Software Systems through Knowledge Graph Representation",
    "TypeScript's Evolution: An Analysis of Feature Adoption Over Time",
    "DGMF: Fast Generation of Comparable, Updatable Dependency Graphs for Software Repositories",
    "GIRT-Data: Sampling GitHub Issue Report Templates",
    "Feature Toggle Usage Patterns : A Case Study on Google Chromium",
    "On Codex Prompt Engineering for OCL Generation: An Empirical Study",
    "Wasmizer: Curating WebAssembly-driven Projects on GitHub",
    "Enriching Source Code with Contextual Data for Code Completion Models: An Empirical Study",
    "microSecEnD: A Dataset of Security-Enriched Dataflow Diagrams for Microservice Applications",
    "Model-Agnostic Syntactical Information for Pre-Trained Programming Language Models",
    "What Happens When We Fuzz? Investigating OSS-Fuzz Bug History",
    "Cross-Domain Evaluation of a Deep Learning-Based Type Inference System",
    "An Empirical Study on the Performance of Individual Issue Label Prediction",
    "Tutorial: Recognizing Developers' Emotions Using Non-invasive Biometrics Sensors",
    "HasBugs - Handpicked Haskell Bugs",
    "Semantically-enriched Jira Issue Tracking Data",
    "An exploratory study of bug introducing changes: what happens when bugs are introduced in open source software?",
    "An Empirical Study of High Performance Computing (HPC) Performance Bugs",
    "Investigating the Resolution of Vulnerable Dependencies with Dependabot Security Updates",
    "Are We Speeding Up or Slowing Down? On Temporal Aspects of Code Velocity",
    "Unveiling the Relationship Between Continuous Integration and Code Coverage",
    "The Atlassian Data Lake: consolidating enriched software development data in a single, queryable system",
    "EGAD: A Moldable Tool for GitHub Action Analysis",
    "An Exploratory Study on Energy Consumption of Dataframe Processing Libraries",
    "Energy Consumption Estimation of API-usage in Mobile Apps via Static Analysis",
    "Understanding issues related to personal data and data protection in open source projects on GitHub",
    "Whistleblowing and Tech on Twitter",
    "SecretBench: A Dataset of Software Secrets",
    "UNGOML: Automated Classification of unsafe Usages in Go",
    "Connecting the .dotfiles: Checked-In Secret Exposure with Extra (Lateral Movement) Steps",
    "MANDO-HGT: Heterogeneous Graph Transformers for Smart Contract Vulnerability Detection",
    "Towards Code-Aware AI Models for Code",
    "Tutorial: Mining and Analysing Collaboration in git Repositories with git2net",
    "An Empirical Study to Investigate Collaboration Among Developers in Open Source Software (OSS)",
    "Keep the Ball Rolling: Analyzing Release Cadence in GitHub Projects",
    "Evolution of the Practice of Software Testing in Java Projects",
    "Do Subjectivity and Objectivity Always Agree? A Case Study with Stack Overflow Questions",
    "The Secret Life of CVEs",
    "Insights into Female Contributions in Open-Source Projects",
    "Understanding the Role of Images on Stack Overflow",
    "A Dataset of Bot and Human Activities in GitHub",
    "What Warnings Do Engineers Really Fix? The Compiler That Cried Wolf",
    "PENTACET data - 23 Million Code Comments and 500,000 SATD comments",
    "DocMine: A Software Documentation-Related Dataset of 950 GitHub Repositories",
    "GiveMeLabeledIssues: An Open Source Issue Recommendation System",
    "DACOS-A Manually Annotated Dataset of Code Smells",
    "A Large Scale Analysis of Semantic Versioning in NPM",
    "Automating Arduino Programming: From Hardware Setups to Sample Source Code Generation",
    "Boosting Just-in-Time Defect Prediction with Specific Features of C Programming Languages in Code Changes",
    "Pre-trained Model Based Feature Envy Detection",
    "CLEAN++: Code Smells Extraction for C++",
    "Mining the Characteristics of Jupyter Notebooks in Data Science Projects",
    "Optimizing Duplicate Size Thresholds in IDEs",
    "Don't Forget the Exception! Considering Robustness Changes to Identify Design Problems",
    "Determining Open Source Project Boundaries",
    "Tutorial: Beyond the leading edge. What else is out there?",
    "PyMigBench: A Benchmark for Python Library Migration",
    "Phylogenetic Analysis of Reticulate Software Evolution",
    "Method Chaining Redux: An Empirical Study of Method Chaining in Java, Kotlin, and Python",
    "Intertwining Communities: Exploring Libraries that Cross Software Ecosystems",
    "Open Source Software Digital Sociology: Quantifying and Understanding Large Complex Open Source Ecosystems",
    "Large Language Models and Simple, Stupid Bugs",
    "Snapshot Testing Dataset",
    "Human-Centered AI for SE: Reflection and Vision",
    "Control and Data Flow in Security Smell Detection for Infrastructure as Code: Is It Worth the Effort?",
    "Helm Charts for Kubernetes Applications: Evolution, Outdatedness and Security Risks",
    "A Study of Gender Discussions in Mobile Apps",
    "The ABLoTS Approach for Bug Localization: is it replicable and generalizable?",
    "She Elicits Requirements and He Tests: Software Engineering Gender Bias in Large Language Models",
    "LLMSecEval: A Dataset of Natural Language Prompts for Security Evaluations",
    "Defectors: A Large, Diverse Python Dataset for Defect Prediction",
    "Tell Me Who Are You Talking to and I Will Tell You What Issues Need Your Skills",
    "GitHub OSS Governance File Dataset"
]